In [1]:
import pandas as pd

In [37]:
df = pd.DataFrame(
    [
        range(1,21,2),
        range(2,21,2),
        range(10,101,10)
    ], 
    columns=[f'co{r}'for r in range(1,11)]
)
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

## 값 변경
### 특정 위치의 값 변경

In [38]:
# 인덱스 1과 컬럼 co2 위치의 값을 100으로 변경
df.co2[1] = 100
df['co2'][1] = 100
df.loc[1, 'co2'] =100
df.iloc[1, 1] = 100
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2  100    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [34]:
# 컬럼 co2의 값을 2배
df.co2 * 2

0      6
1    200
2     40
Name: co2, dtype: int64

In [39]:
# 원본 수정
df.co2 = df.co2 * 2
df['co2'] = df['co2'] * 2
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1   12    5    7    9   11   13   15   17    19
1    2  400    6    8   10   12   14   16   18    20
2   10   80   30   40   50   60   70   80   90   100

In [40]:
# 인덱스 0~1, 컬럼 co4~co6 위치의 값을 10 감소
df.loc[0:1, 'co4':'co6'] = df.loc[0:1, 'co4':'co6'] - 10
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1   12    5   -3   -1    1   13   15   17    19
1    2  400    6   -2    0    2   14   16   18    20
2   10   80   30   40   50   60   70   80   90   100

## 조건에 맞는 값 추출

In [41]:
# 1) 컬럼 co2에서 400인 데이터 추출
# 이 결과를 mask라고 함
df.co2 == 400
df['co2'] == 400

0    False
1     True
2    False
Name: co2, dtype: bool

In [42]:
df.loc[df.co2 == 400]

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
1    2  400    6   -2    0    2   14   16   18    20

In [43]:
df.loc[df.co2 == 400, 'co2']

1    400
Name: co2, dtype: int64

In [44]:
df.loc[df.co2 == 400, ['co2', 'co4', 'co6']]

   co2  co4  co6
1  400   -2    2

In [45]:
# 컬럼 co7에서 홀수인 행만 추출
df.loc[df.co7 % 2 == 1]

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1   12    5   -3   -1    1   13   15   17    19